# frozen_string_literal: true

# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Development
brew 'postgresql'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask 'alfred'
cask 'bartender'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'java'
cask 'rubymine'
cask 'skype'
cask 'slack'
cask 'vscode'
cask 'sublime-text'
cask 'tableplus'
cask 'telegram-desktop'
cask 'transmission'
cask 'webtorrent'
cask 'vagrant'
cask 'virtualbox' # Might need to allow access in Security settings
cask 'virtualbox-extension-pack'
cask 'vlc'
cask '1password'
cask 'tweetbot'
cask 'postgres'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'

cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-hack'
cask 'font-fira-mono'
cask 'font-fira-code'
cask 'font-ibm-plex'
cask 'font-inter'

# Mac App Store
mas 'The Unarchiver', id: 425_424_353
mas 'Magent', id: 441_258_766
mas 'WireGuard', id: 1_451_685_025
mas 'Harvest', id: 506_189_836
